# 1. Напишите программу, которая принимает на вход число N и выдает последовательность из N чисел

# N = int(input("N = "))
# a = 1

# for i in range(N):
#     print(a, end=' ')
#     a *= -3

# 2. Создать список, длины n, значения формируются по формуле
# 3k + 1, где K принимает значения от 1 до n включительно.

# list = []
# n = int(input("n = "))

# for k in range(1, (n + 1)):
#     list.append(3 * k + 1)
# print(list)

# 3. Напишите программу, в которой пользователь будет задавать 2 строки, программа 
# - определять количество вхождений одной строки в другой

# a = input()
# b = input()
# print(a.count(b))